-- 1. Виведіть кількість викладачів кафедри «Software Development».

-- 2. Виведіть кількість лекцій, які веде викладач «Christopher Harris».
SELECT COUNT(ID)
FROM LECTURES
WHERE TEACHERID = (
	SELECT ID 
	FROM TEACHERS
	WHERE LOWER(NAME) = LOWER('Christopher') AND LOWER(SURNAME) = LOWER('Harris')
);

-- 3. Виведіть кількість занять, які проводяться в аудиторії «D201».
-- 4. Виведіть назви аудиторій та кількість лекцій, які проводяться в них.
-- 5. Виведіть кількість студентів, які відвідують лекції викладача «Jack Underhill».

-- SELECT STUDENTS.ID, NAME, SURNAME, GROUPID
-- FROM STUDENTS
-- JOIN GROUPSSTUDENTS ON STUDENTS.ID = STUDENTID
-- WHERE GROUPSSTUDENTS.GROUPID = 



-- 6. Виведіть середню ставку викладачів факультету «Computer Science».
-- 7. Виведіть мінімальну та максимальну кількість студентів серед усіх груп.
-- 8. Виведіть середній фонд фінансування кафедр.
-- 9. Виведіть повні імена викладачів і кількість проведених ними дисциплін.
-- 10. Виведіть кількість лекцій у кожен день тижня.
-- 11. Виведіть номери аудиторій та кількість кафедр, чиї лекції у них ведуться.
-- 12. Виведіть назви факультетів і кількість предметів, які на них ведуться.
-- 13. Виведіть кількість лекцій для кожної пари викладач-аудиторія.
